app/Controllers/EmployeeController.php

SELECT *
FROM `employees`
---
    public function index()
    {
        $employee = new Employee();
        $data['employee'] = $employee->findAll();

INSERT INTO `employees` (`first_name`, `last_name`, `email`, `phone`, `desgination`) VALUES ('ram', 'singh', 'ram@gmail.com', '7856458922', 'employee')
---
    public function store()
    {
        $employee = new Employee();
        $data = [
            'first_name' => $this->request->getPost('first_name'),
            'last_name' => $this->request->getPost('last_name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
            'desgination' => $this->request->getPost('desigination')
        ];
        $employee->save($data);

SELECT *
FROM `employees`
WHERE `employees`.`id` = '2'
---
    public function edit($id)
    {
        $employee = new Employee();
        $data['employee'] = $employee->find($id);

DELETE FROM `employees`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        $employee = new Employee();
        $employee->delete($id);